InformationRegisters/ПродажиМашинозаезды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПродажиМашинозаезды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПродажиМашинозаезды/Ext/ManagerModule.bsl
Функция Загрузить(Сигнатура, Номер, Дата, ДатаЗакрытия) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Сигнатура) 	= Тип("Строка");
	Доступно = Доступно И ТипЗнч(Номер)			= Тип("Строка");
	Доступно = Доступно И ТипЗнч(Дата) 			= Тип("Дата");
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия) 	= Тип("Дата");	
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);

	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ = РегистрыСведений.ПродажиМашинозаезды.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = Сигнатура;
	НЗ.Прочитать();
	
	Если НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;
	
	НЗ.Сигнатура 				= Сигнатура;
	НЗ.Номер 					= Номер;
	НЗ.Дата 					= Дата;
	НЗ.ДатаЗакрытия				= ДатаЗакрытия;
			
	Попытка
		НЗ.Записать();
	Исключение
		Данные = "Сигнатура = "+Сигнатура+ "; Номер = "+Номер+"; Дата = "+Дата+"; ДатаЗакрытия = "+ДатаЗакрытия;
		ЗаписьЖурналаРегистрации("ПродажиМашинозаезды.Загрузить().Ошибка записи", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПродажиМашинозаезды, Данные, ОписаниеОшибки());
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции

Функция УстановиЗначениеРеквизита(Сигнатура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Данные = "Сигнатура="+Сигнатура+"; ИмяРеквизита="+ИмяРеквизита+"; ЗначениеРеквизита="+ЗначениеРеквизита;
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	Доступно = Доступно И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено");
	Доступно = Доступно И ЗначениеЗаполнено(ЗначениеРеквизита);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.ПродажиМашинозаезды.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Сигнатура	=	Сигнатура;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ПродажиМашинозаезды.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		//НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;
	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;

	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ПродажиМашинозаезды, Данные, ОписаниеОшибки());
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;	
КонецФункции
